Modules/Edu/Api/TopicController.php

    public function recommendList()
    {
        $topics = Topic::where('site_id', SID)->where('recommend', 1)->with('user')->latest()->get();
---
select * from `edu_topic` where `site_id` = 1 and `recommend` = 1 order by `created_at` desc

    public function commentList(Topic $topic)
    {
        $comments = $topic->comments()->with(['user', 'replyUser'])->latest()->paginate(10);
---
select * from `users` where `users`.`id` in (1)