Modules/Edu/Api/VideoController.php

select * from `edu_user_video` where `site_id` = 1 order by `updated_at` desc limit 10
select * from `edu_videos` where `edu_videos`.`id` in (9707, 12490, 12632, 12633, 12634, 12635, 12715, 13021, 13090, 13424)
select * from `users` where `users`.`id` in (1, 37175, 38441, 39073, 39712)
---
    public function PlayList(Site $site)
    {
        $userVideos = UserVideo::with(['video', 'user'])->where('site_id', $site['id'])->latest('updated_at')->limit(10)->get();