app/Services/Module/ModuleService.php

    public function initConfig(Site $site, Module $module)
    {
        $model = ModuleConfig::where('site_id', $site['id'])->where('module_id', $module['id'])->first();
---
select * from `module_configs` where `site_id` = 1 and `module_id` = 1 limit 1

    public function getByDomain(): ?Module
    {
        $path = parse_url(request()->url())['path'] ?? '';
        $path = preg_replace('/\/api/', '', $path);
        preg_match('/^\/(\w+)\/?/i', $path, $matches);
        return Module::where('name', $matches[1] ?? '')->first();
---
select * from `modules` where `name` = 'Edu' limit 1