<?php
return [
    /*
    |--------------------------------------------------------------------------
    | token
    |--------------------------------------------------------------------------
    | 微信绑定验证时使用的token, 需要与微信公众号后台保持一致
    | http://mp.weixin.qq.com/wiki/8/f9a0b8382e0b77d87b3bcc1ce6fbc104.html
    */
    'token'          => env('wechat_token', ''),

    /*
    |--------------------------------------------------------------------------
    | 缓存目录
    |--------------------------------------------------------------------------
    | 用于缓存ACCESS_TOKEN等数据
    */
    'cache_path'     => env('wechat_cache_path', public_path() . '/cache/wechat'),

    /*
    |--------------------------------------------------------------------------
    | encodingaeskey
    |--------------------------------------------------------------------------
    | 需要与微信公众号后台保持一致
    | http://mp.weixin.qq.com/wiki/8/f9a0b8382e0b77d87b3bcc1ce6fbc104.html
    */
    'encodingaeskey' => env('wechat_encodingaeskey', ''),

    /*
    |--------------------------------------------------------------------------
    | 公众号身份标识
    |--------------------------------------------------------------------------
    | 填写公众号认证后腾讯官网发来的邮件中的appid
    */
    'appid'          => env('wechat_appid', ''),

    /*
    |--------------------------------------------------------------------------
    | appsecret
    |--------------------------------------------------------------------------
    | 公众平台API的权限获取所需密钥Key
    | 需要与微信公众号后台保持一致
    */
    'appsecret'      => env('wechat_appsecret', ''),

    /*
    |--------------------------------------------------------------------------
    | 支付商户号
    |--------------------------------------------------------------------------
    | 微信发来的邮件中的微信支付商户号
    */
    'mch_id'         => env('wechat_mch_id', ''),

    /*
    |--------------------------------------------------------------------------
    | 商户支付密钥
    |--------------------------------------------------------------------------
    | 用于生成支付签名等使用
    | 登录微信支付-商户平台 API安全中获取
    | https://pay.weixin.qq.com/index.php/core/cert/api_cert
    */
    'key'            => env('wechat_key', ''),

    /*
    |--------------------------------------------------------------------------
    | 证书
    |--------------------------------------------------------------------------
    | 使用微信红包接口等功能时需要的证书
    | 请登录微信支付后台下载，并保证文件目录正确
    */
    'apiclient_cert' => env('wechat_apiclient_cert', 'cert/apiclient_cert.pem'),
    'apiclient_key'  => env('wechat_apiclient_key', 'cert/apiclient_key.pem'),
    'rootca'         => env('wechat_rootca', 'cert/rootca.pem'),
];
