Modules/Edu/Policies/SignPolicy.php

select exists(select * from `edu_sign` where `user_id` = 1 and date(`created_at`) = '2021-02-26') as `exists`
---
    public function create(User $user)
    {
        $isSign = Sign::where('user_id', $user->id)->whereDate('created_at', now())->exists();