app/Services/Site/SiteService.php

    public function getByDomain(): ?Site
    {
        $host = parse_url(request()->url())['host'];
        return Site::where('domain', 'regexp', 'https?:\/\/' . $host)->first();
---
select * from `sites` where `domain` regexp 'https?:\/\/hdcms.test' limit 1